<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 133.0.3065.69--><displayName/><description/><resources><stringTable><string id="Network_group">Ρυθμίσεις δικτύου</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Κάντε Access-Control-Allow-Methods αντιστοίχιση στη CORS συμμόρφωση προδιαγραφών πριν από την πτήση</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Αυτή η πολιτική ελέγχει εάν οι μέθοδοι αίτησης είναι σε κεφαλαία κατά την αντιστοίχιση με τις αρχικές Access-Control-Allow-Methods κεφαλίδες απόκρισης στο CORS.

Εάν αυτή η πολιτική είναι απενεργοποιημένη, οι μέθοδοι αίτησης είναι σε κεφαλαία. Αυτή είναι η συμπεριφορά στο ή πριν από το Microsoft Edge 108.

Εάν η πολιτική είναι ενεργοποιημένη ή δεν έχει οριστεί, οι μέθοδοι αίτησης δεν είναι σε κεφαλαία, εκτός εάν συμφωνούν χωρίς διάκριση πεζών-κεφαλαίων με DELETE, GET, HEAD, OPTIONS, POST, ή PUT.

Αυτό θα απέρριπτε την κεφαλίδα απόκρισης fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot;,
και θα δεχόταν την κεφαλίδα απόκρισης fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot;.

Σημείωση: οι μέθοδοι αίτησης &quot;post&quot; και &quot;put&quot; δεν επηρεάζονται, ενώ επηρεάζεται η &quot;patch&quot;.

Αυτή η πολιτική προορίζεται να είναι προσωρινή και θα καταργηθεί στο μέλλον.</string><string id="BlockTruncatedCookies">Αποκλεισμός περικομμένων cookies (υπό κατάργηση)</string><string id="BlockTruncatedCookies_Explain">ΥΠΟ ΚΑΤΑΡΓΗΣΗ: Αυτή η πολιτική είναι υπό κατάργηση και δεν λειτουργεί μετά τον Microsoft Edge 131.

Αυτή η πολιτική παρέχει μια προσωρινή εξαίρεση για αλλαγές στον τρόπο με τον οποίο το Microsoft Edge χειρίζεται cookie που έχουν οριστεί μέσω JavaScript που περιέχουν ορισμένους χαρακτήρες ελέγχου (NULL, επαναφορά επιστροφής και αλλαγή γραμμής).
Προηγουμένως, η παρουσία οποιουδήποτε από αυτούς τους χαρακτήρες σε μια συμβολοσειρά cookie θα προκαλούσε περικοπή, αλλά εξακολουθεί να ορίζεται.
Τώρα, η παρουσία αυτών των χαρακτήρων θα προκαλέσει την παράβλεψη ολόκληρης της συμβολοσειράς cookie.

Εάν ενεργοποιήσετε ή δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, η νέα συμπεριφορά θα είναι ενεργοποιημένη.

Εάν απενεργοποιήσετε αυτήν την πολιτική, ενεργοποιείται η παλιά συμπεριφορά.

Αυτή η πολιτική είναι υπό κατάργηση, επειδή αυτή η πολιτική υλοποιήθηκε αρχικά ως μέτρο ασφαλείας σε περίπτωση διακοπής, αλλά δεν έχει αναφερθεί καμία.</string><string id="ZstdContentEncodingEnabled">Ενεργοποίηση υποστήριξης κωδικοποίησης περιεχομένου zstd</string><string id="ZstdContentEncodingEnabled_Explain">Αυτή η δυνατότητα επιτρέπει την υποστήριξη διαφήμισης &quot;zstd&quot; στην κεφαλίδα αίτησης αποδοχής κωδικοποίησης και υποστήριξη για αποσυμπίεση περιεχομένου Web zstd.

Αν ενεργοποιήσετε ή δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, Microsoft Edge θα δέχεται αποκρίσεις διακομιστή συμπιεσμένες με zstd.

Αν απενεργοποιήσετε αυτήν την πολιτική, η δυνατότητα κωδικοποίησης περιεχομένου zstd δεν θα κοινοποιείται ή να υποστηρίζεται κατά την επεξεργασία αποκρίσεων διακομιστή.

Αυτή η πολιτική είναι προσωρινή και θα καταργηθεί στο μέλλον.</string><string id="WebView2LoaderOverrideSettings_group">Ρυθμίσεις παράκαμψης φορτωτή</string><string id="BrowserExecutableFolder">Ρύθμιση παραμέτρων της θέσης του εκτελέσιμου φακέλου του προγράμματος περιήγησης</string><string id="BrowserExecutableFolder_Explain">Αυτή η πολιτική ρυθμίζει τις παραμέτρους WebView2 εφαρμογών για να χρησιμοποιήσετε το WebView2 Runtime στην καθορισμένη διαδρομή. Ο φάκελος θα πρέπει να περιέχει τα ακόλουθα αρχεία: msedgewebview2.exe, msedge.dll και ούτω καθεξής.

Για να ορίσετε την τιμή για τη διαδρομή του φακέλου, πληκτρολογήστε το όνομα της τιμής και το συνδυασμό τιμής. Ορίστε το όνομα της τιμής στο όνομα του μοντέλου χρήστη της εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμοστεί σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Ρύθμιση παραμέτρων της θέσης του εκτελέσιμου φακέλου του προγράμματος περιήγησης</string><string id="ChannelSearchKind">Ρύθμιση παραμέτρων του είδους αναζήτησης καναλιού έκδοσης WebView2</string><string id="ChannelSearchKind_Explain">Αυτή η πολιτική ρυθμίζει τις παραμέτρους του είδους αναζήτησης καναλιού για εφαρμογές WebView2. Από προεπιλογή, το είδος αναζήτησης καναλιού είναι 0, το οποίο είναι ισοδύναμο με το είδος αναζήτησης &quot;Πιο σταθερή&quot; στο αντίστοιχο API WebView2. Αυτό υποδεικνύει ότι η δημιουργία περιβάλλοντος WebView2 θα πρέπει να αναζητήσει ένα κανάλι έκδοσης από το πιο σταθερό έως το λιγότερο σταθερό: WebView2 Runtime, Beta, Dev και Canary.

Για να αντιστρέψετε την προεπιλεγμένη σειρά αναζήτησης και να χρησιμοποιήσετε το είδος αναζήτησης &quot;Λιγότερο σταθερή&quot;, ορίστε αυτήν την πολιτική σε 1.

Για να ορίσετε την τιμή για το είδος αναζήτησης καναλιού, καταχωρήστε ένα όνομα τιμής και ένα ζεύγος τιμών. Ορισμός ονόματος τιμής στο αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμόσετε σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Ρύθμιση παραμέτρων του είδους αναζήτησης καναλιού έκδοσης WebView2</string><string id="ReleaseChannelPreference">Ορισμός προτιμήσεων σειράς αναζήτησης για το κανάλι κυκλοφορίας (υπό απόσυρση)</string><string id="ReleaseChannelPreference_Explain">ΥΠΟ ΑΠΟΣΥΡΣΗ: Αυτή η πολιτική θα αποσυρθεί. Υποστηρίζεται αυτήν τη στιγμή, αλλά θα αποσυρθεί σε μελλοντική έκδοση.

Αυτή η πολιτική είναι υπό απόσυρση υπέρ του ChannelSearchKind, το οποίο έχει την ίδια λειτουργικότητα και θα καταργηθεί στην κυκλοφορία 124. Η προεπιλεγμένη σειρά αναζήτησης καναλιού είναι WebView2 Runtime, Beta, Dev και Canary.

Για να αντιστρέψετε την προεπιλεγμένη σειρά αναζήτησης, ορίστε αυτήν την πολιτική σε 1.

Για να ορίσετε την τιμή για την προτίμηση καναλιού έκδοσης, καταχωρήστε ένα όνομα τιμής και ένα ζεύγος τιμών. Ορισμός ονόματος τιμής στο αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμόσετε σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Ορισμός προτιμήσεων σειράς αναζήτησης για το κανάλι κυκλοφορίας (υπό απόσυρση)</string><string id="ReleaseChannels">Ρύθμιση παραμέτρων των καναλιών έκδοσης WebView2</string><string id="ReleaseChannels_Explain">Αυτή η πολιτική ρυθμίζει τις παραμέτρους των επιλογών καναλιού έκδοσης για εφαρμογές WebView2. Για να ρυθμίσετε τις παραμέτρους αυτών των επιλογών, ορίστε την τιμή σε μια συμβολοσειρά ακεραίων διαχωρισμένων με κόμματα, η οποία αντιστοιχίζεται στις τιμές &quot;COREWEBVIEW2_RELEASE_CHANNELS&quot; από το αντίστοιχο API WebView2. Αυτές οι τιμές είναι: WebView2 Runtime (0), Beta (1), Dev (2) και Canary (3). Από προεπιλογή, η δημιουργία περιβάλλοντος αναζητά κανάλια από τα περισσότερο προς τα λιγότερο σταθερά, χρησιμοποιώντας το πρώτο κανάλι που βρέθηκε στη συσκευή. Όταν παρέχονται ReleaseChannels, η δημιουργία περιβάλλοντος θα αναζητήσει μόνο τα κανάλια που καθορίζονται στο σύνολο. Για παράδειγμα, οι τιμές &quot;0,2&quot; και &quot;2,0&quot; υποδεικνύουν ότι η δημιουργία περιβάλλοντος θα πρέπει να πραγματοποιεί αναζήτηση μόνο για κανάλι Dev και WebView2 Runtime, χρησιμοποιώντας τη σειρά που υποδεικνύεται από την ιδιότητα ChannelSearchKind. Η δημιουργία περιβάλλοντος επιχειρεί να ερμηνεύσει κάθε ακέραιο και αντιμετωπίζει οποιαδήποτε μη έγκυρη καταχώρηση ως σταθερό κανάλι. Ορίστε την ιδιότητα ChannelSearchKind για να αντιστρέψετε τη σειρά αναζήτησης, ώστε η δημιουργία περιβάλλοντος να αναζητήσει πρώτα τη λιγότερο σταθερή δομή. Εάν παρέχεται BrowserExecutableFolder όσο και ReleaseChannels, η ιδιότητα BrowserExecutableFolder έχει προτεραιότητα, ανεξάρτητα από το αν το κανάλι BrowserExecutableFolder περιλαμβάνεται στο ReleaseChannels.

Για να ορίσετε την τιμή για τα κανάλια έκδοσης, καταχωρήστε ένα όνομα τιμής και ένα ζεύγος τιμών. Ορίστε το όνομα της τιμής στο αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να εφαρμόσετε σε όλες τις εφαρμογές.

Παράδειγμα τιμής:

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Ρύθμιση παραμέτρων των καναλιών έκδοσης WebView2</string><string id="ExperimentationAndConfigurationServiceControl">Έλεγχος επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</string><string id="ExperimentationAndConfigurationServiceControl_Explain">H υπηρεσία πειραματισμού και ρυθμίσεων χρησιμοποιείται για την ανάπτυξη ωφέλιμων φορτίων πειραματισμού και ρύθμισης παραμέτρων στον πελάτη.

Το ωφέλιμο φορτίο πειραματισμού αποτελείται από μια λίστα με τις πρώιμες δυνατότητες που αναπτύσσονται από τη Microsoft με σκοπό τη δοκιμή και την παροχή σχολίων.

Το ωφέλιμο φορτίο ρύθμισης παραμέτρων αποτελείται από μια λίστα προτεινόμενων ρυθμίσεων που θέλει να αναπτύξει η Microsoft ώστε να βελτιστοποιήσει την εμπειρία χρήστη.

Το ωφέλιμο φορτίο ρύθμισης παραμέτρων μπορεί επίσης να περιλαμβάνει μια λίστα ενεργειών που μπορούν να εκτελεστούν για λόγους συμβατότητας. Για παράδειγμα, το πρόγραμμα περιήγησης μπορεί να παρακάμπτει τη συμβολοσειρά παράγοντα χρήστη σε μια τοποθεσία Web, αν η συγκεκριμένη τοποθεσία είναι κατεστραμμένη. Κάθε μία από τις ενέργειες αυτές εφαρμόζονται προσωρινά όσο προσπαθεί η Microsoft να λύσει το πρόβλημα σε συνεργασία με τον κάτοχο της τοποθεσίας.

Αν ορίσετε αυτήν την πολιτική σε &quot;FullMode&quot;, θα γίνεται λήψη του πλήρους ωφέλιμου φορτίου από την υπηρεσία πειραματισμού και ρυθμίσεων. Σε αυτό περιλαμβάνονται τόσο το ωφέλιμο φορτίο πειραματισμού όσο και το ωφέλιμο φορτίο ρύθμισης παραμέτρων.

Αν ορίσετε αυτήν την πολιτική σε &quot;ConfigurationsOnlyMode&quot;, θα κατεβαίνει μόνο το ωφέλιμο φορτίο ρύθμισης παραμέτρων.

Αν ορίσετε αυτήν την πολιτική σε &quot;RestrictedMode&quot;, θα διακοπεί πλήρως η επικοινωνία με την υπηρεσία πειραματισμού και ρυθμίσεων.Η Microsoft δεν συνιστά αυτήν τη ρύθμιση.

Αν δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, σε μια διαχειριζόμενη συσκευή, η συμπεριφορά στα κανάλια Stable και Beta θα είναι ίδια με τη λειτουργία &quot;ConfigurationsOnlyMode&quot;. Στα κανάλια Canary και Dev η συμπεριφορά είναι ίδια με τη λειτουργία &quot;FullMode&quot;.

Αν δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, σε μια μη διαχειριζόμενη συσκευή, η συμπεριφορά θα είναι ίδια με τη λειτουργία &quot;FullMode&quot;.

Αντιστοίχιση επιλογών πολιτικής:

* FullMode (2) = Ανάκτηση ρυθμίσεων παραμέτρων και πειραματισμού

* ConfigurationsOnlyMode (1) = Ανάκτηση μόνο ρυθμίσεων παραμέτρων

* RestrictedMode (0) = Απενεργοποίηση επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων

Χρησιμοποιήστε τις προηγούμενες πληροφορίες κατά τη ρύθμιση των παραμέτρων αυτής της πολιτικής.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Ανάκτηση ρυθμίσεων παραμέτρων και πειραματισμού</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Ανάκτηση μόνο ρυθμίσεων παραμέτρων</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Απενεργοποίηση επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Ελέγχει εάν οι χειριστές συμβάντων unload μπορούν να απενεργοποιηθούν.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">unload οι δείκτες χειρισμού συμβάντων καταργούνται. Το αν ενεργοποιούνται εξαρτάται από το unload Permissions-Policy.
Προς το παρόν, επιτρέπονται από την πολιτική από προεπιλογή. Στο μέλλον, θα μετακινούνται σταδιακά στο να μην επιτρέπονται από προεπιλογή και οι τοποθεσίες πρέπει να τις ενεργοποιούν ρητά χρησιμοποιώντας τις κεφαλίδες Permissions-Policy.
Αυτή η εταιρική πολιτική μπορεί να χρησιμοποιηθεί για να εξαιρεθείτε από αυτήν τη σταδιακή απόσυρση, επιβάλλοντας στην προεπιλογή να παραμείνει ενεργοποιημένη.

Οι σελίδες ενδέχεται να εξαρτώνται από unload δείκτες χειρισμού συμβάντων για την αποθήκευση δεδομένων ή την σηματοδότηση του τέλους μιας περιόδου λειτουργίας χρήστη στο διακομιστή.
Αυτό δεν συνιστάται επειδή δεν είναι αξιόπιστο και επηρεάζει τις επιδόσεις αποκλείοντας τη χρήση του BackForwardCache.
Υπάρχουν προτεινόμενες εναλλακτικές λύσεις, αλλά το συμβάν unload έχει χρησιμοποιηθεί για μεγάλο χρονικό διάστημα. Ορισμένες εφαρμογές ενδέχεται να εξακολουθούν να βασίζονται σε αυτές.

Αν απενεργοποιήσετε αυτήν την πολιτική ή δεν ρυθμίσετε τις παραμέτρους της, unload χειριστές συμβάντων θα καταργηθούν σταδιακά παράλληλα με την κυκλοφορία της κατάργησης και οι τοποθεσίες που δεν ορίζουν την κεφαλίδα Permissions-Policy θα σταματήσουν να ενεργοποιούν συμβάντα &quot;unload&quot;.

Εάν ενεργοποιήσετε αυτήν την πολιτική, τότε unload χειριστές συμβάντων θα συνεχίσουν να λειτουργούν από προεπιλογή.</string><string id="HttpAllowlist">Λίστα επιτρεπόμενων HTTP</string><string id="HttpAllowlist_Explain">Ο ορισμός της πολιτικής καθορίζει μια λίστα ονομάτων κεντρικού υπολογιστή ή μοτίβων ονόματος κεντρικού υπολογιστή (όπως '[*.] example.com') που δεν θα αναβαθμιστεί σε HTTPS και δεν θα εμφανίσει ένα παρεμβαλλόμενο σφάλμα εάν είναι ενεργοποιημένη η λειτουργία HTTPS-First. Οι οργανισμοί μπορούν να χρησιμοποιούν αυτήν την πολιτική για να διατηρήσουν την πρόσβαση σε διακομιστές που δεν υποστηρίζουν HTTPS, χωρίς να χρειαστεί να απενεργοποιήσουν το &quot;AutomaticHttpsDefault&quot;.

Τα παρεχόμενα ονόματα κεντρικού υπολογιστή πρέπει να είναι κανονικοποιημένα: Τα αναγνωριστικά πρέπει να μετατραπούν σε μορφή ετικέτας A και όλα τα γράμματα ASCII πρέπει να είναι πεζά.

Δεν επιτρέπονται χαρακτήρες μπαλαντέρ κεντρικού υπολογιστή γενικής χρήσης (π.χ., &quot;*&quot; ή &quot;[*]&quot;). Αντιθέτως, οι αναβαθμίσεις HTTPS-First Mode και HTTPS θα πρέπει να απενεργοποιηθούν ρητά μέσω των συγκεκριμένων πολιτικών τους.

Σημείωση: Αυτή η πολιτική δεν ισχύει για αναβαθμίσεις HSTS.

Παράδειγμα τιμής:

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">Λίστα επιτρεπόμενων HTTP</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Επιτρέπει την ενεργοποίηση της δυνατότητας NewBaseUrlInheritanceBehavior (υπό απόσυρση)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">ΥΠΟ ΑΠΟΣΥΡΣΗ: Αυτή η πολιτική θα αποσυρθεί. Υποστηρίζεται αυτήν τη στιγμή, αλλά θα αποσυρθεί σε μελλοντική έκδοση.

Το NewBaseUrlInheritanceBehavior είναι μια δυνατότητα Microsoft Edge που έχει ως αποτέλεσμα τα πλαίσια about:blank και about:srcdoc να μεταβιβάζουν με συνέπεια τις τιμές της βασικής διεύθυνσης URL τους μέσω στιγμιότυπων της διεύθυνσης URL βάσης του εκκινητή τους.

Εάν απενεργοποιήσετε αυτήν την πολιτική, εμποδίζει τους χρήστες ή Microsoft Edge παραλλαγές να ενεργοποιούν το NewBaseUrlInheritanceBehavior, σε περίπτωση που εντοπίζονται ζητήματα συμβατότητας.

Εάν ενεργοποιήσετε ή δεν ρυθμίσετε τις παραμέτρους αυτής της πολιτικής, θα επιτρέπεται η ενεργοποίηση του NewBaseUrlInheritanceBehavior.

Αυτή η πολιτική βρίσκεται υπό απόσυρση, επειδή η δυνατότητα NewBaseUrlInheritanceBehaviorAllowed έχει καταργηθεί.

Αυτή η πολιτική θα καταργηθεί στην έκδοση 133.</string><string id="NewPDFReaderWebView2List">Ενεργοποίηση ενσωματωμένου προγράμματος ανάγνωσης PDF που παρέχεται από το Adobe Acrobat για WebView2</string><string id="NewPDFReaderWebView2List_Explain">Αυτή η πολιτική ρυθμίζει τις παραμέτρους των εφαρμογών WebView2 για την εκκίνηση της νέας έκδοσης του προγράμματος ανάγνωσης PDF που τροφοδοτείται από το πρόγραμμα ανάγνωσης PDF του Adobe Acrobat. Ο νέος αναγνώστης PDF εξασφαλίζει ότι δεν υπάρχει απώλεια λειτουργικότητας και προσφέρει μια βελτιωμένη εμπειρία PDF. Αυτή η εμπειρία περιλαμβάνει πιο πλούσια απόδοση, βελτιωμένες επιδόσεις, ισχυρή ασφάλεια για τον χειρισμό αρχείων PDF και μεγαλύτερη προσβασιμότητα.

Εάν αυτή η πολιτική καθοριστεί για μια εφαρμογή, είναι πιθανό να επηρεάσει και άλλες σχετικές εφαρμογές. Η πολιτική εφαρμόζεται σε όλα τα WebView2 που κάνουν κοινή χρήση του ίδιου φακέλου δεδομένων χρήστη WebView2. Αυτά τα WebView2 θα μπορούσαν ενδεχομένως να ανήκουν σε πολλές εφαρμογές, εάν αυτές οι εφαρμογές, οι οποίες πιθανότατα ανήκουν στην ίδια οικογένεια προϊόντων, έχουν σχεδιαστεί για να κάνουν κοινή χρήση του ίδιου φακέλου δεδομένων χρήστη.

Χρησιμοποιήστε ένα ζεύγος ονόματος-τιμής για να ενεργοποιήσετε το νέο πρόγραμμα ανάγνωσης PDF για την εφαρμογή. Ορίστε το όνομα στο αναγνωριστικό μοντέλου χρήστη της εφαρμογής ή στο όνομα του εκτελέσιμου αρχείου. Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για να το εφαρμόσετε σε όλες τις εφαρμογές. Ορίστε την Τιμή σε true για να ενεργοποιήσετε το νέο πρόγραμμα ανάγνωσης ή ορίστε την Τιμή σε false για να χρησιμοποιήσετε το υπάρχον.

Εάν ενεργοποιήσετε αυτήν την πολιτική για τις καθορισμένες εφαρμογές WebView2, αυτές θα χρησιμοποιούν το νέο πρόγραμμα ανάγνωσης PDF που υποστηρίζεται από το Adobe Acrobat για το άνοιγμα όλων των αρχείων PDF.

Εάν απενεργοποιήσετε την πολιτική για τις καθορισμένες εφαρμογές WebView2 ή δεν ρυθμίσετε τις παραμέτρους της, αυτές θα χρησιμοποιούν το υπάρχον πρόγραμμα ανάγνωσης PDF για το άνοιγμα όλων των αρχείων PDF.

Παράδειγμα τιμής:

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Ενεργοποίηση ενσωματωμένου προγράμματος ανάγνωσης PDF που παρέχεται από το Adobe Acrobat για WebView2</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Ελέγξτε τη χρήση κλειδιού RSA για πιστοποιητικά διακομιστή που εκδίδονται από τοπικές αγκυρώσεις αξιοπιστίας (υπό απόσυρση)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">ΥΠΟ ΑΠΟΣΥΡΣΗ: Αυτή η πολιτική θα αποσυρθεί. Υποστηρίζεται αυτήν τη στιγμή, αλλά θα αποσυρθεί σε μελλοντική έκδοση.

Αυτή η πολιτική είναι υπό απόσυρση επειδή η δυνατότητα RSAKeyUsageForLocalAnchorsEnabled έχει καταργηθεί.

Αυτή η πολιτική θα καταργηθεί στην έκδοση 133.

Η επέκταση χρήσης κλειδιού X.509 δηλώνει τον τρόπο με τον οποίο μπορεί να χρησιμοποιηθεί το κλειδί σε ένα
πιστοποιητικό. Αυτές οι οδηγίες διασφαλίζουν ότι τα πιστοποιητικά δεν χρησιμοποιούνται σε ανεπιθύμητο
περιβάλλον, γεγονός που προστατεύει από μια κατηγορία επιθέσεων διασταυρούμενων πρωτοκόλλων στο HTTPS και
σε άλλα πρωτόκολλα. Τα προγράμματα-πελάτες HTTPS πρέπει να επαληθεύουν ότι τα πιστοποιητικά διακομιστή συμφωνούν με τις
παραμέτρους TLS της σύνδεσης.

Έναρξη στον Microsoft Edge 124, αυτός
ο έλεγχος είναι πάντα ενεργοποιημένος.

Microsoft Edge 123 και παλαιότερη έχουν την
ακόλουθη συμπεριφορά:

Όταν αυτή η πολιτική έχει οριστεί σε ενεργοποιημένη,
το Microsoft Edge θα εκτελέσει αυτόν τον
έλεγχο κλειδιού. Αυτό βοηθά στην αποτροπή επιθέσεων κατά τις οποίες ένας εισβολέας χειραγωγεί το πρόγραμμα περιήγησης ώστε
ώστε να ερμηνεύσει ένα κλειδί με τρόπο που ο κάτοχος του πιστοποιητικού δεν ήθελε.

Όταν αυτή η πολιτική έχει οριστεί σε απενεργοποιημένη,
ο Microsoft Edge θα παραλείψει αυτόν τον έλεγχο κλειδιού σε
συνδέσεις HTTPS που διαπραγματεύονται το TLS 1.2 και χρησιμοποιούν ένα πιστοποιητικό RSA που
που συνδέεται σε μια τοπική αγκύρωση αξιοπιστίας. Παραδείγματα τοπικών αγκυρώσεων αξιοπιστίας περιλαμβάνουν
πιστοποιητικά ρίζας που παρέχονται από την πολιτική ή έχουν εγκατασταθεί από τον χρήστη. Σε όλες τις άλλες περιπτώσεις, ο
έλεγχος εκτελείται ανεξάρτητα από τη ρύθμιση αυτής της πολιτικής.

Εάν αυτή η πολιτική δεν έχει ρυθμιστεί,
ο Microsoft Edge θα συμπεριφέρεται σαν να
είναι ενεργοποιημένη η πολιτική.

Αυτή η πολιτική είναι διαθέσιμη στους διαχειριστές για την προεπισκόπηση της συμπεριφοράς μιας
μελλοντικής έκδοσης, η οποία θα ενεργοποιήσει αυτόν τον έλεγχο από προεπιλογή. Σε αυτό το σημείο, αυτή η
πολιτική θα παραμείνει προσωρινά διαθέσιμη για διαχειριστές που χρειάζονται περισσότερο
χρόνο για να ενημερώσουν τα πιστοποιητικά τους ώστε να πληρούν τις νέες απαιτήσεις χρήσης κλειδιών RSA.

Οι συνδέσεις που αποτυγχάνουν σε αυτόν τον έλεγχο θα αποτύχουν με το σφάλμα
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Οι τοποθεσίες που αποτυγχάνουν με αυτό το σφάλμα πιθανώς να έχουν
εσφαλμένες ρυθμίσεις παραμέτρων πιστοποιητικού. Οι σύγχρονες οικογένειες προγραμμάτων κρυπτογράφησης ECDHE_RSA χρησιμοποιούν την
επιλογή χρήσης κλειδιού &quot;digitalSignature&quot;, ενώ οι οικογένειες προγραμμάτων κρυπτογράφησης αποκρυπτογράφησης RSA παλαιού τύπου
χρησιμοποιούν την επιλογή χρήσης κλειδιού &quot;keyEncipherment&quot;. Εάν δεν είναι σίγουροι, οι διαχειριστές θα πρέπει να
συμπεριλάβουν και τα δύο σε πιστοποιητικά RSA που προορίζονται για HTTPS.</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge έκδοση 97, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge έκδοση 116, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge έκδοση 118, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge έκδοση 87, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V121">Microsoft Edge έκδοση 121, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V123">Microsoft Edge έκδοση 123, Windows 7 ή νεότερη έκδοση</string><string id="SUPPORTED_WIN7_V125">Microsoft Edge έκδοση 125, Windows 7 ή νεότερη έκδοση</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge έκδοση 123-131, Windows 7 ή νεότερη έκδοση</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Προεπιλεγμένες ρυθμίσεις (είναι δυνατή η αντικατάσταση από τους χρήστες)</string></stringTable><presentationTable><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Έλεγχος επικοινωνίας με την υπηρεσία πειραματισμού και ρυθμίσεων</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">Λίστα επιτρεπόμενων HTTP</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Ορισμός ονόματος τιμής στο Αναγνωριστικό μοντέλου χρήστη εφαρμογής ή στο εκτελέσιμο όνομα αρχείου. Μπορείτε να χρησιμοποιήσετε το χαρακτήρα μπαλαντέρ &quot;*&quot; ως όνομα τιμής για εφαρμογή σε όλες τις εφαρμογές.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>